Merge pull request #4117 from shakenfist/sync-docs
Automated documentation sync for 20260906.
